**** SPARQL endpoints
- SPARQL is a SQL-like query langage against a triple-store
- Eg: DBPedia
  - Massive data repository acquired by scraping Wikipedia pages
  - http://dbpedia.org/page/Barack_Obama
  - Sparql endpoint: http://dbpedia.org/sparql
  #+BEGIN_SRC sparql
    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
    SELECT DISTINCT ?barry
    WHERE 
    {
      ?barry rdfs:label "Barack Obama"@en
    } 
    LIMIT 100
   #+END_SRC
   #+RESULTS:
   barry
   http://dbpedia.org/resource/Barack_Obama
   http://dbpedia.org/resource/Category:Barack_Obama
   

